<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><meta name="viewport" content="width=device-width, initial-scale=0.8"/><title>序</title><link rel="stylesheet" type="text/css" href="scribble.css" title="default"/><link rel="stylesheet" type="text/css" href="right.css" title="default"/><link rel="stylesheet" type="text/css" href="scribble-style.css" title="default"/><script type="text/javascript" src="scribble-common.js"></script><!--[if IE 6]><style type="text/css">.SIEHidden { overflow: hidden; }</style><![endif]--></head><body id="scribble-racket-lang-org"><div class="tocset"><div class="tocview"><div class="tocviewlist tocviewlisttopspace"><div class="tocviewtitle"><table cellspacing="0" cellpadding="0"><tr><td style="width: 1em;"><a href="javascript:void(0);" title="Expand/Collapse" class="tocviewtoggle" onclick="TocviewToggle(this,&quot;tocview_0&quot;);">&#9660;</a></td><td></td><td><a href="index.html" class="tocviewlink" data-pltdoc="x">&#32534;&#31243;&#35821;&#35328;&#35201;&#32032;</a></td></tr></table></div><div class="tocviewsublisttop" style="display: block;" id="tocview_0"><table cellspacing="0" cellpadding="0"><tr><td align="right"></td><td><a href="fw-trans.html" class="tocviewlink" data-pltdoc="x">&#35793;&#32773;&#30340;&#35805;</a></td></tr><tr><td align="right"></td><td><a href="glo.html" class="tocviewlink" data-pltdoc="x">&#35793;&#21517;&#34920;</a></td></tr><tr><td align="right"></td><td><a href="" class="tocviewselflink" data-pltdoc="x">&#24207;</a></td></tr><tr><td align="right"></td><td><a href="pf.html" class="tocviewlink" data-pltdoc="x">&#21069;&#35328;</a></td></tr><tr><td align="right"></td><td><a href="awk.html" class="tocviewlink" data-pltdoc="x">&#33268;&#35874;</a></td></tr><tr><td align="right">1&nbsp;</td><td><a href="isd.html" class="tocviewlink" data-pltdoc="x">&#24402;&#32435;&#24335;&#25968;&#25454;&#38598;</a></td></tr><tr><td align="right">2&nbsp;</td><td><a href="da.html" class="tocviewlink" data-pltdoc="x">&#25968;&#25454;&#25277;&#35937;</a></td></tr><tr><td align="right">3&nbsp;</td><td><a href="expr.html" class="tocviewlink" data-pltdoc="x">&#34920;&#36798;&#24335;</a></td></tr><tr><td align="right">4&nbsp;</td><td><a href="state.html" class="tocviewlink" data-pltdoc="x">&#29366;&#24577;</a></td></tr><tr><td align="right">5&nbsp;</td><td><a href="cpi.html" class="tocviewlink" data-pltdoc="x">&#20256;&#36882;&#32493;&#25991;&#30340;&#35299;&#37322;&#22120;</a></td></tr><tr><td align="right">6&nbsp;</td><td><a href="cps.html" class="tocviewlink" data-pltdoc="x">&#32493;&#25991;&#20256;&#36882;&#39118;&#26684;</a></td></tr><tr><td align="right">7&nbsp;</td><td><a href="types.html" class="tocviewlink" data-pltdoc="x">&#31867;&#22411;</a></td></tr><tr><td align="right">8&nbsp;</td><td><a href="modules.html" class="tocviewlink" data-pltdoc="x">&#27169;&#22359;</a></td></tr><tr><td align="right">9&nbsp;</td><td><a href="oac.html" class="tocviewlink" data-pltdoc="x">&#23545;&#35937;&#21644;&#31867;</a></td></tr><tr><td align="right">10&nbsp;</td><td><a href="further-reading.html" class="tocviewlink" data-pltdoc="x">&#25193;&#23637;&#38405;&#35835;</a></td></tr><tr><td align="right">11&nbsp;</td><td><a href="sllgen-parsing-system.html" class="tocviewlink" data-pltdoc="x">SLLGEN&#35299;&#26512;&#31995;&#32479;</a></td></tr><tr><td align="right"></td><td><a href="bib.html" class="tocviewlink" data-pltdoc="x">&#21442;&#32771;&#20070;&#30446;</a></td></tr><tr><td align="right"></td><td><a href="indices.html" class="tocviewlink" data-pltdoc="x">&#32034;&#24341;</a></td></tr></table></div></div><div class="tocviewlist"><table cellspacing="0" cellpadding="0"><tr><td style="width: 1em;"><a href="javascript:void(0);" title="Expand/Collapse" class="tocviewtoggle" onclick="TocviewToggle(this,&quot;tocview_1&quot;);">&#9658;</a></td><td></td><td><a href="" class="tocviewselflink" data-pltdoc="x">&#24207;</a></td></tr></table><div class="tocviewsublistbottom" style="display: none;" id="tocview_1"><table cellspacing="0" cellpadding="0"><tr><td align="right"></td><td><a href="#%28part._fw-s%29" class="tocviewlink" data-pltdoc="x">&#19977;&#29256;&#38468;&#35328;</a></td></tr></table></div></div></div><div class="tocsub"><div class="tocsubtitle">On this page:</div><table class="tocsublist" cellspacing="0"><tr><td><span class="tocsublinknumber"></span><a href="#%28part._fw-s%29" class="tocsubseclink" data-pltdoc="x">&#19977;&#29256;&#38468;&#35328;</a></td></tr></table></div></div><div class="maincolumn"><div class="main"><div class="navsettop"><span class="navleft"><div class="nosearchform"></div>&nbsp;&nbsp;<span class="tocsettoggle">&nbsp;&nbsp;<a href="javascript:void(0);" title="show/hide table of contents" onclick="TocsetToggle();">contents</a></span></span><span class="navright">&nbsp;&nbsp;<a href="glo.html" title="backward to &quot;译名表&quot;" data-pltdoc="x">&larr; prev</a>&nbsp;&nbsp;<a href="index.html" title="up to &quot;编程语言要素&quot;" data-pltdoc="x">up</a>&nbsp;&nbsp;<a href="pf.html" title="forward to &quot;前言&quot;" data-pltdoc="x">next &rarr;</a></span>&nbsp;</div><h3><a name="(part._fw)"></a>&#24207;</h3><p><a name="(idx._(gentag._0))"></a>
&#26412;&#20070;&#24341;&#20320;&#30452;&#38754;&#35745;&#31639;&#26426;&#32534;&#31243;&#20013;&#26368;&#22522;&#26412;&#30340;&#24605;&#24819;&#65306;</p><blockquote class="SCentered"><p><span class="emph">&#35745;&#31639;&#26426;&#35821;&#35328;&#30340;&#35299;&#37322;&#22120;&#19981;&#36807;&#26159;&#21478;&#19968;&#20010;&#31243;&#24207;</span>&#12290;</p></blockquote><p>&#21548;&#19978;&#21435;&#26174;&#32780;&#26131;&#35265;&#65292;&#19981;&#26159;&#21527;&#65311;&#20294;&#26159;&#21547;&#20041;&#39047;&#28145;&#12290;&#33509;&#20320;&#26159;&#35745;&#31639;&#29702;&#35770;&#23398;&#23478;&#65292;&#35299;&#37322;&#22120;&#24605;&#24819;&#20250;&#20351;&#20320;&#24819;&#36215;&#21733;
&#24503;&#23572;&#21457;&#29616;&#30340;&#24418;&#24335;&#36923;&#36753;&#31995;&#32479;&#23616;&#38480;&#65292;&#22270;&#28789;&#30340;&#36890;&#29992;&#35745;&#31639;&#26426;&#27010;&#24565;&#65292;&#36824;&#26377;&#20911;&#35834;&#20381;&#26364;&#23384;&#20648;&#31243;&#24207;&#26426;&#30340;&#22522;&#26412;&#24605;
&#24819;&#12290;&#33509;&#20320;&#26159;&#31243;&#24207;&#21592;&#65292;&#25484;&#25569;&#35299;&#37322;&#22120;&#24605;&#24819;&#21017;&#26159;&#24040;&#22823;&#21147;&#37327;&#30340;&#28304;&#27849;&#12290;&#23427;&#22914;&#28748;&#39030;&#37261;&#37264;&#65292;&#33021;&#24443;&#24213;&#25913;&#21464;&#20320;&#24605;
&#32771;&#32534;&#31243;&#30340;&#26041;&#24335;&#12290;</p><p>&#21548;&#35828;&#35299;&#37322;&#22120;&#20043;&#21069;&#65292;&#25105;&#20415;&#27809;&#23569;&#32534;&#31243;&#65292;&#20063;&#24320;&#21457;&#36807;&#19968;&#20123;&#22823;&#22411;&#31243;&#24207;&#12290;&#20854;&#20013;&#19968;&#20363;&#26159;&#30001; PL/I &#20889;&#25104;&#30340;&#22823;&#22411;
&#25968;&#25454;&#21644;&#20449;&#24687;&#26816;&#32034;&#31995;&#32479;&#12290;&#23454;&#29616;&#31995;&#32479;&#26102;&#65292;&#25105;&#25226; PL/I &#30475;&#20316;&#19968;&#25209;&#22266;&#23450;&#30340;&#35268;&#21017;&#65292;&#30001;&#19968;&#20123;&#36965;&#19981;&#21487;&#21450;&#30340;&#35821;
&#35328;&#35774;&#35745;&#32773;&#35746;&#31435;&#12290;&#25105;&#35748;&#20026;&#25105;&#30340;&#24037;&#20316;&#19981;&#26159;&#20462;&#25913;&#36825;&#20123;&#35268;&#21017;&#65292;&#29978;&#25110;&#28145;&#20837;&#29702;&#35299;&#23427;&#20204;&#65292;&#32780;&#26159;&#20174;&#65288;&#26497;&#20026;&#65289;&#28009;
&#32321;&#30340;&#25163;&#20876;&#20013;&#25361;&#25361;&#25315;&#25315;&#65292;&#36873;&#20986;&#36825;&#31181;&#37027;&#31181;&#21151;&#33021;&#26469;&#29992;&#12290;&#25105;&#20174;&#27809;&#24819;&#36807;&#26377;&#19968;&#20123;&#28508;&#34255;&#30340;&#32467;&#26500;&#32452;&#32455;&#35821;&#35328;&#65292;&#20063;
&#19981;&#35273;&#24471;&#25105;&#21487;&#33021;&#24471;&#25512;&#32763;&#35821;&#35328;&#35774;&#35745;&#32773;&#30340;&#19968;&#20123;&#20915;&#23450;&#12290;&#25105;&#19981;&#30693;&#36947;&#22914;&#20309;&#21019;&#36896;&#23884;&#21512;&#30340;&#23376;&#35821;&#35328;&#26469;&#24110;&#25105;&#32452;&#32455;&#31995;
&#32479;&#23454;&#29616;&#65292;&#25152;&#20197;&#25972;&#20010;&#31243;&#24207;&#19981;&#26159;&#21508;&#37096;&#20998;&#33021;&#22815;&#28789;&#27963;&#32452;&#21512;&#30340;&#20960;&#31181;&#35821;&#35328;&#65292;&#20498;&#20687;&#24133;&#24222;&#26434;&#30340;&#39532;&#36187;&#20811;&#65292;&#27599;&#29255;&#37117;
&#24471;&#23567;&#24515;&#22609;&#36896;&#21644;&#25918;&#32622;&#12290;&#19981;&#29702;&#35299;&#35299;&#37322;&#22120;&#65292;&#20320;&#36824;&#26159;&#33021;&#32534;&#31243;&#65292;&#29978;&#33267;&#33021;&#25104;&#20026;&#19968;&#21517;&#31216;&#32844;&#30340;&#31243;&#24207;&#21592;&#65292;&#20294;&#20320;&#26080;
&#27861;&#25104;&#20026;&#22823;&#24072;&#12290;</p><p><a name="(idx._(gentag._1))"></a>
&#20316;&#20026;&#19968;&#21517;&#31243;&#24207;&#21592;&#65292;&#20986;&#20110;&#19977;&#20010;&#21407;&#22240;&#65292;&#20320;&#24212;&#35813;&#20102;&#35299;&#35299;&#37322;&#22120;&#12290;</p><p>&#39318;&#20808;&#65292;&#22312;&#26576;&#20123;&#26102;&#21051;&#65292;&#20320;&#24471;&#23454;&#29616;&#35299;&#37322;&#22120;&#8212;&#8212;&#20063;&#35768;&#19981;&#26159;&#20840;&#33021;&#32780;&#36890;&#29992;&#35821;&#35328;&#30340;&#35299;&#37322;&#22120;&#65292;&#20294;&#32456;&#24402;&#26159;&#35299;&#37322;&#22120;&#12290;
&#20960;&#20046;&#27599;&#19968;&#20010;&#19982;&#20154;&#28789;&#27963;&#20132;&#20114;&#30340;&#22797;&#26434;&#35745;&#31639;&#26426;&#31995;&#32479;&#8212;&#8212;&#20363;&#22914;&#65292;&#35745;&#31639;&#26426;&#32472;&#22270;&#24037;&#20855;&#25110;&#20449;&#24687;&#26816;&#32034;&#31995;&#32479;&#8212;&#8212;&#37117;&#21253;
&#21547;&#26576;&#31181;&#35299;&#37322;&#22120;&#26469;&#32452;&#32455;&#20132;&#20114;&#12290;&#36825;&#20123;&#31243;&#24207;&#21487;&#33021;&#21253;&#21547;&#22797;&#26434;&#30340;&#21333;&#39033;&#25805;&#20316;&#8212;&#8212;&#22312;&#26174;&#31034;&#23631;&#30340;&#19968;&#20010;&#21306;&#22495;&#21152;&#19978;&#38452;
&#24433;&#65292;&#25110;&#25191;&#34892;&#25968;&#25454;&#24211;&#25628;&#32034;&#8212;&#8212;&#20294;&#35299;&#37322;&#22120;&#26159;&#33014;&#27700;&#65292;&#20351;&#20320;&#23558;&#21333;&#39033;&#25805;&#20316;&#32452;&#21512;&#25104;&#26377;&#29992;&#30340;&#27169;&#24335;&#12290;&#20320;&#33021;&#25226;&#19968;&#39033;
&#25805;&#20316;&#30340;&#32467;&#26524;&#24403;&#20316;&#21478;&#19968;&#25805;&#20316;&#30340;&#36755;&#20837;&#21527;&#65311;&#20320;&#33021;&#32473;&#19968;&#20010;&#25805;&#20316;&#24207;&#21015;&#21629;&#21517;&#21527;&#65311;&#21517;&#23383;&#26159;&#23616;&#37096;&#30340;&#36824;&#26159;&#20840;&#23616;&#30340;&#65311;
&#20320;&#33021;&#32473;&#19968;&#20010;&#25805;&#20316;&#24207;&#21015;&#21152;&#19978;&#21442;&#25968;&#65292;&#24182;&#32473;&#23427;&#30340;&#36755;&#20837;&#21629;&#21517;&#21527;&#65311;&#35832;&#22914;&#27492;&#31867;&#12290;&#19981;&#35770;&#21333;&#39033;&#25805;&#20316;&#22810;&#20040;&#22797;&#26434;&#31934;
&#24039;&#65292;&#24120;&#24120;&#26159;&#33014;&#27700;&#30340;&#36136;&#37327;&#26368;&#30452;&#25130;&#22320;&#20915;&#23450;&#31995;&#32479;&#30340;&#33021;&#21147;&#12290;&#24456;&#23481;&#26131;&#25214;&#21040;&#21333;&#39033;&#25805;&#20316;&#33391;&#22909;&#65292;&#20294;&#33014;&#27700;&#31967;&#31957;&#30340;
&#31243;&#24207;&#65307;&#22238;&#22836;&#26469;&#30475;&#65292;&#25105;&#35273;&#24471;&#25105;&#30340; PL/I &#25968;&#25454;&#24211;&#31243;&#24207;&#33014;&#27700;&#23454;&#22312;&#31967;&#31957;&#12290;</p><p>&#20854;&#27425;&#65292;&#21363;&#20351;&#31243;&#24207;&#26412;&#36523;&#19981;&#26159;&#35299;&#37322;&#22120;&#65292;&#20063;&#21253;&#21547;&#31867;&#20284;&#35299;&#37322;&#22120;&#30340;&#37325;&#35201;&#29255;&#27573;&#12290;&#32454;&#31350;&#19968;&#20010;&#22797;&#26434;&#30340;&#35745;&#31639;&#26426;&#36741;
&#21161;&#35774;&#35745;&#31995;&#32479;&#65292;&#20320;&#21487;&#33021;&#21457;&#29616;&#21327;&#21516;&#24037;&#20316;&#30340;&#20960;&#20309;&#22270;&#24418;&#35782;&#21035;&#35821;&#35328;&#65292;&#22270;&#24418;&#35299;&#37322;&#22120;&#65292;&#22522;&#20110;&#35268;&#21017;&#30340;&#25511;&#21046;&#35299;&#37322;
&#22120;&#65292;&#20197;&#21450;&#38754;&#21521;&#23545;&#35937;&#35821;&#35328;&#35299;&#37322;&#22120;&#12290;&#32452;&#32455;&#22797;&#26434;&#31243;&#24207;&#26368;&#26377;&#25928;&#30340;&#26041;&#24335;&#20043;&#19968;&#26159;&#35270;&#20043;&#20026;&#19968;&#32452;&#35821;&#35328;&#65292;&#27599;&#31181;&#35821;
&#35328;&#20174;&#19981;&#21516;&#35282;&#24230;&#65292;&#20197;&#19981;&#21516;&#26041;&#24335;&#22788;&#29702;&#31243;&#24207;&#20803;&#32032;&#12290;&#20026;&#21512;&#36866;&#30340;&#30446;&#30340;&#36873;&#25321;&#21512;&#36866;&#30340;&#35821;&#35328;&#65292;&#29702;&#35299;&#23454;&#29616;&#26102;&#30340;&#21033;
&#24330;&#26435;&#34913;&#65306;&#36825;&#23601;&#26159;&#35299;&#37322;&#22120;&#30740;&#31350;&#30340;&#20869;&#23481;&#12290;</p><p>&#23398;&#20064;&#35299;&#37322;&#22120;&#30340;&#31532;&#19977;&#20010;&#21407;&#22240;&#65292;&#26159;&#30452;&#25509;&#28041;&#21450;&#35821;&#35328;&#32467;&#26500;&#30340;&#32534;&#31243;&#25216;&#26415;&#26085;&#30410;&#37325;&#35201;&#12290;&#22914;&#20170;&#65292;&#25805;&#20316;&#38754;&#21521;&#23545;&#35937;
&#31995;&#32479;&#20013;&#31867;&#30340;&#23618;&#27425;&#22791;&#21463;&#20851;&#27880;&#65292;&#32780;&#36825;&#21482;&#26159;&#35813;&#36235;&#21183;&#30340;&#19968;&#20010;&#20363;&#23376;&#12290;&#36825;&#21487;&#33021;&#26159;&#26080;&#21487;&#36991;&#20813;&#30340;&#32467;&#26524;&#65292;&#22240;&#20026;&#25105;
&#20204;&#30340;&#31243;&#24207;&#27491;&#26085;&#36235;&#22797;&#26434;&#8212;&#8212;&#22810;&#30041;&#24515;&#35821;&#35328;&#21487;&#33021;&#26159;&#24212;&#23545;&#36825;&#31181;&#22797;&#26434;&#24615;&#30340;&#26368;&#22909;&#24037;&#20855;&#12290;&#20877;&#24819;&#24819;&#37027;&#20010;&#22522;&#26412;&#24605;&#24819;&#65306;
&#35299;&#37322;&#22120;&#26412;&#36523;&#19981;&#36807;&#26159;&#19968;&#20010;&#31243;&#24207;&#12290;&#20294;&#37027;&#31243;&#24207;&#20197;&#26576;&#31181;&#35821;&#35328;&#20889;&#23601;&#65292;&#20854;&#35299;&#37322;&#22120;&#26412;&#36523;&#19981;&#36807;&#26159;&#21478;&#19968;&#31243;&#24207;&#65292;&#20197;
&#26576;&#31181;&#35821;&#35328;&#20889;&#23601;&#65292;&#20854;&#35299;&#37322;&#22120;&#26412;&#36523;&#21448;&#26159;&#8230;&#8230;&#25110;&#35768;&#25130;&#28982;&#21306;&#20998;&#31243;&#24207;&#21644;&#32534;&#31243;&#35821;&#35328;&#26159;&#20010;&#35823;&#23548;&#24615;&#30340;&#24819;&#27861;&#65292;&#26410;
&#26469;&#30340;&#31243;&#24207;&#21592;&#19981;&#20877;&#33258;&#35270;&#20026;&#32534;&#20889;&#26576;&#31181;&#31243;&#24207;&#65292;&#32780;&#26159;&#20026;&#27599;&#20010;&#24212;&#29992;&#21019;&#36896;&#26032;&#30340;&#35821;&#35328;&#12290;
<a name="(idx._(gentag._2))"></a></p><p>&#24343;&#37324;&#24503;&#26364;&#21644;&#23451;&#24503;&#23436;&#25104;&#20102;&#26631;&#24535;&#24615;&#30340;&#24037;&#20316;&#65292;&#20182;&#20204;&#30340;&#33879;&#20316;&#21183;&#23558;&#25913;&#21464;&#32534;&#31243;&#35821;&#35328;&#35838;&#31243;&#30340;&#22270;&#26223;&#12290;&#20182;&#20204;&#19981;&#21482;
&#32473;&#20320;<span class="emph">&#35762;&#35762;</span>&#35299;&#37322;&#22120;&#65292;&#20182;&#20204;<span class="emph">&#23637;&#31034;</span>&#32473;&#20320;&#30475;&#12290;&#26412;&#20070;&#30340;&#26680;&#24515;&#26159;&#19968;&#31995;&#21015;&#31934;&#22937;&#30340;&#35299;&#37322;&#22120;&#65292;&#22987;
&#20110;&#19968;&#31181;&#39640;&#32423;&#25277;&#35937;&#35821;&#35328;&#65292;&#36880;&#27493;&#25581;&#31034;&#35821;&#35328;&#29305;&#24615;&#65292;&#30452;&#33267;&#19968;&#29366;&#24577;&#26426;&#12290;&#20107;&#23454;&#19978;&#20320;&#21487;&#20197;&#36816;&#34892;&#36825;&#20123;&#20195;&#30721;&#65292;&#30740;
&#20064;&#21644;&#20462;&#25913;&#23427;&#20204;&#65292;&#25913;&#21464;&#36825;&#20123;&#35299;&#37322;&#22120;&#30340;&#22788;&#29702;&#26041;&#24335;&#65292;&#35832;&#22914;&#23450;&#30028;&#12289;&#21442;&#25968;&#20256;&#36882;&#12289;&#25511;&#21046;&#32467;&#26500;&#65292;&#31561;&#31561;&#12290;</p><p>&#20316;&#32773;&#20197;&#35299;&#37322;&#22120;&#30740;&#31350;&#35821;&#35328;&#30340;&#25191;&#34892;&#65292;&#24182;&#23637;&#31034;&#20102;&#22914;&#20309;&#29992;&#21516;&#26679;&#30340;&#24605;&#24819;&#19981;&#21152;&#36816;&#34892;&#22320;&#20998;&#26512;&#31243;&#24207;&#12290;&#22312;&#26032;&#22686;&#30340;
&#20004;&#31456;&#20013;&#65292;&#20182;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#23454;&#29616;&#31867;&#22411;&#26816;&#26597;&#22120;&#21644;&#25512;&#23548;&#22120;&#65292;&#20197;&#21450;&#36825;&#20123;&#29305;&#24615;&#22312;&#29616;&#20195;&#38754;&#21521;&#23545;&#35937;&#32534;&#31243;&#35821;&#35328;
&#20013;&#22914;&#20309;&#20132;&#20114;&#12290;</p><p>&#36825;&#31181;&#26041;&#27861;&#20043;&#25152;&#20197;&#21560;&#24341;&#20154;&#65292;&#37096;&#20998;&#22312;&#20110;&#20316;&#32773;&#36873;&#25321;&#20102;&#20248;&#33391;&#30340;&#24037;&#20855;&#8212;&#8212;Scheme &#35821;&#35328;&#12290;&#36825;&#31181;&#35821;&#35328;&#32467;&#21512;&#20102;
Lisp &#30340;&#32479;&#19968;&#35821;&#27861;&#21644;&#25968;&#25454;&#25277;&#35937;&#33021;&#21147;&#65292;&#20197;&#21450; Algol &#30340;&#35789;&#27861;&#23450;&#30028;&#21644;&#22359;&#29366;&#32467;&#26500;&#12290;&#20294;&#21033;&#22120;&#21040;&#20102;&#22823;&#24072;&#25163;
&#20013;&#26041;&#33021;&#29289;&#23613;&#20854;&#29992;&#12290;&#26412;&#20070;&#30340;&#31034;&#20363;&#35299;&#37322;&#22120;&#36275;&#21487;&#22402;&#33539;&#12290;&#30830;&#23454;&#22914;&#27492;&#65292;&#22240;&#20026;&#20182;&#20204;&#26159;<span class="emph">&#21487;&#20197;&#36816;&#34892;</span>&#30340;
&#31034;&#33539;&#12290;&#25105;&#30830;&#20449;&#36825;&#20123;&#35299;&#37322;&#22120;&#21644;&#20998;&#26512;&#22120;&#23558;&#22312;&#26410;&#26469;&#25968;&#24180;&#29616;&#36523;&#20110;&#35768;&#22810;&#32534;&#31243;&#31995;&#32479;&#30340;&#26680;&#24515;&#20043;&#20013;&#12290;</p><p>&#36825;&#19981;&#26159;&#26412;&#23481;&#26131;&#30340;&#20070;&#12290;&#35299;&#37322;&#22120;&#38590;&#20197;&#25484;&#25569;&#19981;&#26159;&#27809;&#26377;&#21407;&#22240;&#30340;&#12290;&#35821;&#35328;&#35774;&#35745;&#32773;&#35201;&#27604;&#26222;&#36890;&#24212;&#29992;&#30340;&#24320;&#21457;&#32773;&#26356;
&#21152;&#36828;&#31163;&#26368;&#32456;&#29992;&#25143;&#12290;&#35774;&#35745;&#24212;&#29992;&#31243;&#24207;&#26102;&#65292;&#20320;&#32771;&#34385;&#23558;&#35201;&#23436;&#25104;&#30340;&#20855;&#20307;&#20219;&#21153;&#65292;&#20197;&#21450;&#23558;&#35201;&#21253;&#21547;&#30340;&#21151;&#33021;&#12290;&#20294;
&#35774;&#35745;&#35821;&#35328;&#26102;&#65292;&#20320;&#32771;&#34385;&#20154;&#20204;&#24819;&#35201;&#23454;&#29616;&#30340;&#31181;&#31181;&#24212;&#29992;&#65292;&#20197;&#21450;&#23454;&#29616;&#23427;&#20204;&#30340;&#21487;&#33021;&#26041;&#24335;&#12290;&#20320;&#30340;&#35821;&#35328;&#24212;&#35813;&#26159;
&#38745;&#24577;&#20316;&#29992;&#22495;&#36824;&#26159;&#21160;&#24577;&#20316;&#29992;&#22495;&#65292;&#25110;&#32773;&#20108;&#32773;&#20860;&#26377;&#65311;&#23427;&#24212;&#35813;&#26377;&#32487;&#25215;&#21527;&#65311;&#23427;&#20256;&#36882;&#21442;&#25968;&#26102;&#26159;&#20256;&#24341;&#29992;&#36824;&#26159;
&#20256;&#20540;&#65311;<span class="emph">&#32493;&#25991;</span>&#24212;&#35813;&#26159;&#26174;&#24335;&#30340;&#36824;&#26159;&#38544;&#24335;&#30340;&#65311;&#36825;&#20123;&#37117;&#21462;&#20915;&#20110;&#20320;&#24819;&#35753;&#20320;&#30340;&#35821;&#35328;&#22914;&#20309;&#20351;&#29992;&#65292;&#21738;
&#20123;&#31243;&#24207;&#24212;&#35813;&#24456;&#23481;&#26131;&#32534;&#20889;&#65292;&#21738;&#20123;&#31243;&#24207;&#21487;&#20197;&#19981;&#37027;&#20040;&#26131;&#20889;&#12290;</p><p>&#27492;&#22806;&#65292;&#35299;&#37322;&#22120;&#23454;&#22312;<span class="emph">&#26159;</span>&#24494;&#22937;&#30340;&#31243;&#24207;&#12290;&#35299;&#37322;&#22120;&#20013;&#19968;&#34892;&#20195;&#30721;&#30340;&#31616;&#21333;&#25913;&#21464;&#37117;&#33021;&#20351;&#26368;&#32456;&#35821;&#35328;&#30340;
&#34892;&#20026;&#21457;&#29983;&#21095;&#21464;&#12290;&#21035;&#24819;&#31895;&#35835;&#36825;&#20123;&#31243;&#24207;&#8212;&#8212;&#21363;&#20351;&#26159;&#30456;&#23545;&#31616;&#21333;&#30340;&#20195;&#30721;&#65292;&#19990;&#19978;&#20063;&#32477;&#23569;&#26377;&#20154;&#33021;&#22815;&#19968;&#30629;&#26032;&#30340;
&#35299;&#37322;&#22120;&#23601;&#39044;&#27979;&#23427;&#30340;&#34892;&#20026;&#12290;&#25152;&#20197;&#38075;&#30740;&#36825;&#20123;&#31243;&#24207;&#21543;&#12290;&#26368;&#22909;&#65292;<span class="emph">&#36816;&#34892;</span>&#23427;&#20204;&#8212;&#8212;&#36825;&#20123;&#26159;&#33021;&#36816;&#34892;&#30340;
&#20195;&#30721;&#12290;&#35797;&#30528;&#35299;&#37322;&#19968;&#20123;&#31616;&#21333;&#30340;&#34920;&#36798;&#24335;&#65292;&#28982;&#21518;&#35797;&#35797;&#26356;&#22797;&#26434;&#30340;&#12290;&#28155;&#21152;&#38169;&#35823;&#20449;&#24687;&#12290;&#20462;&#25913;&#35299;&#37322;&#22120;&#12290;&#35774;&#35745;
&#20320;&#33258;&#24049;&#30340;&#21464;&#20307;&#12290;&#35797;&#30528;&#30495;&#27491;&#25484;&#25569;&#36825;&#20123;&#31243;&#24207;&#65292;&#32780;&#19981;&#26159;&#23545;&#20043;&#22914;&#20309;&#24037;&#20316;&#31895;&#20855;&#21360;&#35937;&#12290;</p><p>&#22914;&#26524;&#20320;&#36825;&#26679;&#20570;&#20102;&#65292;&#20320;&#23545;&#32534;&#31243;&#21644;&#36523;&#20026;&#31243;&#24207;&#21592;&#30340;&#33258;&#24049;&#30475;&#27861;&#23450;&#20250;&#19981;&#21516;&#12290;&#20320;&#23558;&#33258;&#35270;&#20026;&#35821;&#35328;&#30340;&#35774;&#35745;&#24072;&#65292;
&#32780;&#19981;&#20165;&#26159;&#35821;&#35328;&#30340;&#29992;&#25143;&#12290;&#20320;&#23558;&#25104;&#20026;&#35821;&#35328;&#32452;&#25104;&#35268;&#21017;&#30340;&#20027;&#20154;&#65292;&#32780;&#19981;&#20165;&#26159;&#20182;&#20154;&#25152;&#36873;&#35268;&#21017;&#30340;&#38543;&#20174;&#12290;
<a name="(idx._(gentag._3))"></a></p><h4><a name="(part._fw-s)"></a>&#19977;&#29256;&#38468;&#35328;</h4><p><a name="(idx._(gentag._4))"></a>
&#19978;&#36848;&#24207;&#35328;&#20889;&#20110;&#30701;&#30701;&#19971;&#24180;&#20043;&#21069;&#12290;&#22312;&#20061;&#21313;&#24180;&#20195;&#65292;&#38590;&#20197;&#24819;&#35937;&#19971;&#24180;&#20043;&#20869;&#65292;&#20449;&#24687;&#24212;&#29992;&#21644;&#26381;&#21153;&#24050;&#36941;&#24067;&#20840;&#29699;&#12290;
&#23427;&#20204;&#30001;&#25345;&#32493;&#22686;&#38271;&#30340;&#32534;&#31243;&#35821;&#35328;&#21644;&#32534;&#31243;&#26694;&#26550;&#39537;&#21160;&#8212;&#8212;&#36825;&#19968;&#20999;&#37117;&#22522;&#20110;&#19981;&#26029;&#22766;&#22823;&#30340;&#35299;&#37322;&#22120;&#24179;&#21488;&#12290;</p><p>&#24819;&#21019;&#24314; Web &#39029;&#38754;&#21527;&#65311;&#22312;&#20061;&#21313;&#24180;&#20195;&#65292;&#37027;&#31561;&#20110;&#26684;&#24335;&#21270;&#38745;&#24577;&#25991;&#26412;&#21644;&#22270;&#20687;&#65292;&#23454;&#38469;&#19978;&#26159;&#21019;&#24314;&#30001;&#27983;&#35272;&#22120;
&#36816;&#34892;&#30340;&#31243;&#24207;&#65292;&#32780;&#27983;&#35272;&#22120;&#20165;&#20165;&#25191;&#34892;&#19968;&#26465;&#8220;print&#8221;&#35821;&#21477;&#12290;&#20170;&#22825;&#30340;
&#21160;&#24577;&#32593;&#39029;&#20805;&#20998;&#21033;&#29992;&#33050;&#26412;&#35821;&#35328;&#65288;&#35299;&#37322;&#24615;&#35821;&#35328;&#30340;&#21478;&#19968;&#21517;&#23383;&#65289;&#65292;&#22914; Javascript&#12290;&#27983;&#35272;&#22120;&#31243;&#24207;&#21017;&#30456;
&#24403;&#22797;&#26434;&#65292;&#21253;&#21547;&#23545; Web &#26381;&#21153;&#22120;&#30340;&#24322;&#27493;&#35843;&#29992;&#12290;&#32780;&#26381;&#21153;&#22120;&#36890;&#24120;&#36816;&#34892;&#30528;&#21478;&#19968;&#31243;&#24207;&#65292;&#30001;&#23436;&#20840;&#19981;&#21516;&#30340;&#32534;
&#31243;&#26694;&#26550;&#20889;&#23601;&#12290;&#26694;&#26550;&#21448;&#21487;&#33021;&#21547;&#26377;&#22810;&#31181;&#26381;&#21153;&#65292;&#27599;&#31181;&#26381;&#21153;&#37117;&#26377;&#21508;&#33258;&#30340;&#35821;&#35328;&#12290;</p><p>&#25110;&#32773;&#20320;&#35201;&#21019;&#24314;&#19968;&#20010;&#26426;&#22120;&#20154;&#65292;&#22312;&#22823;&#22411;&#22810;&#20154;&#22312;&#32447;&#28216;&#25103;&#8212;&#8212;&#22914;&#39764;&#20861;&#19990;&#30028;&#8212;&#8212;&#20013;&#25913;&#21892;&#24418;&#35937;&#12290;&#36825;&#26102;&#65292;&#20320;&#21487;&#33021;
&#20351;&#29992; Lua &#20043;&#31867;&#30340;&#33050;&#26412;&#35821;&#35328;&#8212;&#8212;&#36824;&#21487;&#33021;&#25903;&#25345;&#38754;&#21521;&#23545;&#35937;&#25193;&#23637;&#8212;&#8212;&#26469;&#21327;&#21161;&#34920;&#36798;&#21508;&#31867;&#34892;&#20026;&#12290;</p><p>&#21448;&#25110;&#32773;&#20320;&#22312;&#20026;&#22823;&#22411;&#35745;&#31639;&#26426;&#38598;&#32676;&#32534;&#31243;&#65292;&#36827;&#34892;&#20840;&#29699;&#35268;&#27169;&#30340;&#32034;&#24341;&#21644;&#25628;&#32034;&#12290;&#36825;&#26102;&#65292;&#20320;&#21487;&#33021;&#29992;&#20989;&#25968;&#24335;&#32534;
&#31243;&#20013;&#30340; map-reduce &#33539;&#24335;&#26469;&#32534;&#20889;&#31243;&#24207;&#65292;&#20197;&#20943;&#36731;&#26126;&#30830;&#23433;&#25490;&#22788;&#29702;&#22120;&#35843;&#24230;&#32454;&#33410;&#30340;&#36127;&#25285;&#12290;</p><p>&#21448;&#25110;&#32773;&#20320;&#22312;&#20026;&#20256;&#24863;&#22120;&#32593;&#32476;&#24320;&#21457;&#26032;&#30340;&#31639;&#27861;&#65292;&#24182;&#19988;&#23581;&#35797;&#29992;&#25042;&#27714;&#20540;&#26356;&#22909;&#22320;&#35299;&#20915;&#24182;&#34892;&#21644;&#25968;&#25454;&#27719;&#38598;&#38382;&#39064;&#12290;
&#21448;&#25110;&#32773;&#20320;&#22312;&#25506;&#32034; XSLT &#37027;&#26679;&#30340;&#36716;&#25442;&#31995;&#32479;&#26469;&#25511;&#21046; Web &#39029;&#38754;&#12290;&#21448;&#25110;&#32773;&#20320;&#22312;&#35774;&#35745;&#36716;&#25442;&#21644;&#37325;&#28151;&#22810;&#23186;
&#20307;&#27969;&#30340;&#26694;&#26550;&#12290;&#21448;&#25110;&#32773;&#8230;&#8230;</p><p>&#22810;&#23569;&#26032;&#24212;&#29992;&#65281;&#22810;&#23569;&#26032;&#35821;&#35328;&#65281;&#22810;&#23569;&#23853;&#26032;&#30340;&#35299;&#37322;&#22120;&#65281;</p><p>&#20381;&#26087;&#65292;&#32534;&#31243;&#26032;&#25163;&#65292;&#29978;&#33267;&#26377;&#32463;&#39564;&#30340;&#20154;&#65292;&#21487;&#20197;&#20998;&#21035;&#30475;&#24453;&#27599;&#31181;&#26694;&#26550;&#65292;&#22312;&#26082;&#23450;&#30340;&#35268;&#21017;&#20869;&#24037;&#20316;&#12290;&#20294;&#21019;&#36896;
&#26032;&#26694;&#26550;&#35201;&#27714;&#22823;&#24072;&#32423;&#25216;&#33021;&#65306;&#29702;&#35299;&#35821;&#35328;&#36816;&#34892;&#32972;&#21518;&#30340;&#21407;&#29702;&#65292;&#25361;&#36873;&#26368;&#36866;&#21512;&#27599;&#31181;&#24212;&#29992;&#30340;&#35821;&#35328;&#29305;&#24615;&#65292;&#29087;&#30693;
&#22914;&#20309;&#21019;&#36896;&#24102;&#32473;&#35821;&#35328;&#29983;&#21629;&#30340;&#35299;&#37322;&#22120;&#12290;&#36825;&#20123;&#26159;&#20320;&#33021;&#20174;&#26412;&#20070;&#23398;&#21040;&#30340;&#25216;&#33021;&#12290;
<a name="(idx._(gentag._5))"></a>
<br/></p><p><span class="Sright">Hal Abelson</span>
<span class="Sright">&#21073;&#26725;&#65292;&#39532;&#33832;&#35832;&#22622;&#24030;</span>
<span class="Sright">2007&#24180;9&#26376;</span></p><div class="navsetbottom"><span class="navleft"><div class="nosearchform"></div>&nbsp;&nbsp;<span class="tocsettoggle">&nbsp;&nbsp;<a href="javascript:void(0);" title="show/hide table of contents" onclick="TocsetToggle();">contents</a></span></span><span class="navright">&nbsp;&nbsp;<a href="glo.html" title="backward to &quot;译名表&quot;" data-pltdoc="x">&larr; prev</a>&nbsp;&nbsp;<a href="index.html" title="up to &quot;编程语言要素&quot;" data-pltdoc="x">up</a>&nbsp;&nbsp;<a href="pf.html" title="forward to &quot;前言&quot;" data-pltdoc="x">next &rarr;</a></span>&nbsp;</div></div></div><div id="contextindicator">&nbsp;</div></body></html>