<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><meta name="viewport" content="width=device-width, initial-scale=0.8"/><title>前言</title><link rel="stylesheet" type="text/css" href="scribble.css" title="default"/><link rel="stylesheet" type="text/css" href="footnote.css" title="default"/><link rel="stylesheet" type="text/css" href="scribble-style.css" title="default"/><script type="text/javascript" src="scribble-common.js"></script><script type="text/javascript">
(function() {
  document.write('<link rel="stylesheet" href="katex/katex.min.css" />');
})();(function() {document.write('<scr' + 'ipt type="text/javascript" src="katex/katex.min.js"></scr' + 'ipt>');})();(function(f) {
  // A "simple" onLoad function
  if (window.document.readyState == "complete") {
    f();
  } else if (window.document.addEventListener) {
    window.document.addEventListener("DOMContentLoaded", f, false);
  } else if (window.attachEvent) {
    window.attachEvent("onreadystatechange", function() {
      if (window.document.readyState == "complete") {
        f();
      }
    });
  } else {
    var oldLoad = window.onload;
    if (typeof(oldLoad) == "function") {
      window.onload = function() {
        try {
          oldLoad();
        } finally {
          f();
        }
      };
    } else {
      window.onload = f;
    }
  }
})(function() {
  // This is an ugly way to change the doctype, in case the scribble document
  // did not use (with-html5).
  if (!(document.doctype && document.doctype.publicId == '')) {
    if (console && console.log) {
      console.log("Re-wrote the document to use the HTML5 doctype.\n"
                  + "  Consider using the following declaration:\n"
                  + "      @title[#:style (with-html5 manual-doc-style)]{…}");
    }
    var wholeDoc = '<!doctype HTML>\n' + document.documentElement.outerHTML;
    document.open();
    document.clear();
    document.write(wholeDoc);
  }
  var inlineElements = document.getElementsByClassName("texMathInline");
  for (var i = 0; i < inlineElements.length; i++) {
    var e = inlineElements[i];
    katex.render(e.textContent, e, { displayMode:false, throwOnError:false });
  }
  var displayElements = document.getElementsByClassName("texMathDisplay");
  for (var i = 0; i < displayElements.length; i++) {
    var e = displayElements[i];
    katex.render(e.textContent, e, { displayMode:true, throwOnError:false });
  }
});
</script><!--[if IE 6]><style type="text/css">.SIEHidden { overflow: hidden; }</style><![endif]--></head><body id="scribble-racket-lang-org"><div class="tocset"><div class="tocview"><div class="tocviewlist tocviewlisttopspace"><div class="tocviewtitle"><table cellspacing="0" cellpadding="0"><tr><td style="width: 1em;"><a href="javascript:void(0);" title="Expand/Collapse" class="tocviewtoggle" onclick="TocviewToggle(this,&quot;tocview_0&quot;);">&#9660;</a></td><td></td><td><a href="index.html" class="tocviewlink" data-pltdoc="x">&#32534;&#31243;&#35821;&#35328;&#35201;&#32032;</a></td></tr></table></div><div class="tocviewsublisttop" style="display: block;" id="tocview_0"><table cellspacing="0" cellpadding="0"><tr><td align="right"></td><td><a href="fw-trans.html" class="tocviewlink" data-pltdoc="x">&#35793;&#32773;&#30340;&#35805;</a></td></tr><tr><td align="right"></td><td><a href="glo.html" class="tocviewlink" data-pltdoc="x">&#35793;&#21517;&#34920;</a></td></tr><tr><td align="right"></td><td><a href="fw.html" class="tocviewlink" data-pltdoc="x">&#24207;</a></td></tr><tr><td align="right"></td><td><a href="" class="tocviewselflink" data-pltdoc="x">&#21069;&#35328;</a></td></tr><tr><td align="right"></td><td><a href="awk.html" class="tocviewlink" data-pltdoc="x">&#33268;&#35874;</a></td></tr><tr><td align="right">1&nbsp;</td><td><a href="isd.html" class="tocviewlink" data-pltdoc="x">&#24402;&#32435;&#24335;&#25968;&#25454;&#38598;</a></td></tr><tr><td align="right">2&nbsp;</td><td><a href="da.html" class="tocviewlink" data-pltdoc="x">&#25968;&#25454;&#25277;&#35937;</a></td></tr><tr><td align="right">3&nbsp;</td><td><a href="expr.html" class="tocviewlink" data-pltdoc="x">&#34920;&#36798;&#24335;</a></td></tr><tr><td align="right">4&nbsp;</td><td><a href="state.html" class="tocviewlink" data-pltdoc="x">&#29366;&#24577;</a></td></tr><tr><td align="right">5&nbsp;</td><td><a href="cpi.html" class="tocviewlink" data-pltdoc="x">&#20256;&#36882;&#32493;&#25991;&#30340;&#35299;&#37322;&#22120;</a></td></tr><tr><td align="right">6&nbsp;</td><td><a href="cps.html" class="tocviewlink" data-pltdoc="x">&#32493;&#25991;&#20256;&#36882;&#39118;&#26684;</a></td></tr><tr><td align="right">7&nbsp;</td><td><a href="types.html" class="tocviewlink" data-pltdoc="x">&#31867;&#22411;</a></td></tr><tr><td align="right">8&nbsp;</td><td><a href="modules.html" class="tocviewlink" data-pltdoc="x">&#27169;&#22359;</a></td></tr><tr><td align="right">9&nbsp;</td><td><a href="oac.html" class="tocviewlink" data-pltdoc="x">&#23545;&#35937;&#21644;&#31867;</a></td></tr><tr><td align="right">10&nbsp;</td><td><a href="further-reading.html" class="tocviewlink" data-pltdoc="x">&#25193;&#23637;&#38405;&#35835;</a></td></tr><tr><td align="right">11&nbsp;</td><td><a href="sllgen-parsing-system.html" class="tocviewlink" data-pltdoc="x">SLLGEN&#35299;&#26512;&#31995;&#32479;</a></td></tr><tr><td align="right"></td><td><a href="bib.html" class="tocviewlink" data-pltdoc="x">&#21442;&#32771;&#20070;&#30446;</a></td></tr><tr><td align="right"></td><td><a href="indices.html" class="tocviewlink" data-pltdoc="x">&#32034;&#24341;</a></td></tr></table></div></div><div class="tocviewlist"><table cellspacing="0" cellpadding="0"><tr><td style="width: 1em;"><a href="javascript:void(0);" title="Expand/Collapse" class="tocviewtoggle" onclick="TocviewToggle(this,&quot;tocview_1&quot;);">&#9658;</a></td><td></td><td><a href="" class="tocviewselflink" data-pltdoc="x">&#21069;&#35328;</a></td></tr></table><div class="tocviewsublistbottom" style="display: none;" id="tocview_1"><table cellspacing="0" cellpadding="0"><tr><td align="right"></td><td><a href="#%28part._pf-obj%29" class="tocviewlink" data-pltdoc="x">&#30446;&#26631;</a></td></tr><tr><td align="right"></td><td><a href="#%28part._pf-org%29" class="tocviewlink" data-pltdoc="x">&#32452;&#32455;</a></td></tr><tr><td align="right"></td><td><a href="#%28part._pf-use%29" class="tocviewlink" data-pltdoc="x">&#29992;&#27861;</a></td></tr></table></div></div></div><div class="tocsub"><div class="tocsubtitle">On this page:</div><table class="tocsublist" cellspacing="0"><tr><td><span class="tocsublinknumber"></span><a href="#%28part._pf-obj%29" class="tocsubseclink" data-pltdoc="x">&#30446;&#26631;</a></td></tr><tr><td><span class="tocsublinknumber"></span><a href="#%28part._pf-org%29" class="tocsubseclink" data-pltdoc="x">&#32452;&#32455;</a></td></tr><tr><td><span class="tocsublinknumber"></span><a href="#%28part._pf-use%29" class="tocsubseclink" data-pltdoc="x">&#29992;&#27861;</a></td></tr></table></div></div><div class="maincolumn"><div class="main"><div class="navsettop"><span class="navleft"><div class="nosearchform"></div>&nbsp;&nbsp;<span class="tocsettoggle">&nbsp;&nbsp;<a href="javascript:void(0);" title="show/hide table of contents" onclick="TocsetToggle();">contents</a></span></span><span class="navright">&nbsp;&nbsp;<a href="fw.html" title="backward to &quot;序&quot;" data-pltdoc="x">&larr; prev</a>&nbsp;&nbsp;<a href="index.html" title="up to &quot;编程语言要素&quot;" data-pltdoc="x">up</a>&nbsp;&nbsp;<a href="awk.html" title="forward to &quot;致谢&quot;" data-pltdoc="x">next &rarr;</a></span>&nbsp;</div><h3><a name="(part._pf)"></a>&#21069;&#35328;</h3><h4><a name="(part._pf-obj)"></a>&#30446;&#26631;</h4><p>&#26412;&#20070;&#26159;&#23545;&#32534;&#31243;&#35821;&#35328;&#30340;&#20998;&#26512;&#24615;&#30740;&#31350;&#12290;&#25105;&#20204;&#30340;&#30446;&#26631;&#26159;&#28145;&#20837;&#26377;&#25928;&#22320;&#29702;&#35299;&#32534;&#31243;&#35821;&#35328;&#30340;&#22522;&#26412;&#27010;&#24565;&#12290;&#36825;&#20123;
&#27010;&#24565;&#30340;&#37325;&#35201;&#24615;&#20037;&#32463;&#35777;&#23454;&#12290;&#23427;&#20204;&#26159;&#29702;&#35299;&#32534;&#31243;&#35821;&#35328;&#26410;&#26469;&#21457;&#23637;&#30340;&#22522;&#30784;&#12290;</p><p><a name="(idx._(gentag._6))"></a>
&#36825;&#20123;&#27010;&#24565;&#22810;&#20851;&#20046;&#31243;&#24207;&#20803;&#32032;&#30340;&#35821;&#20041;&#65292;&#25110;&#31216;&#21547;&#20041;&#12290;&#21547;&#20041;&#21453;&#26144;&#20102;&#20803;&#32032;&#22312;&#31243;&#24207;&#25191;&#34892;&#26102;&#24212;&#24403;&#22914;&#20309;&#35299;&#37322;&#12290;
&#21517;&#20026;&#35299;&#37322;&#22120;&#30340;&#31243;&#24207;&#26368;&#30452;&#25509;&#22320;&#34920;&#29616;&#20102;&#31243;&#24207;&#35821;&#20041;&#65292;&#19988;&#33021;&#25191;&#34892;&#12290;&#23427;&#20204;&#36890;&#36807;&#30452;&#25509;&#20998;&#26512;&#31243;&#24207;&#25991;&#26412;&#30340;&#25277;&#35937;
&#34920;&#31034;&#26469;&#22788;&#29702;&#31243;&#24207;&#12290;&#22240;&#27492;&#25105;&#20204;&#20197;&#35299;&#37322;&#22120;&#20026;&#20027;&#35201;&#36733;&#20307;&#26469;&#34920;&#36798;&#32534;&#31243;&#35821;&#35328;&#20803;&#32032;&#30340;&#35821;&#20041;&#12290;</p><p>&#31243;&#24207;&#20316;&#20026;&#23545;&#35937;&#65292;&#26368;&#23500;&#36259;&#21619;&#30340;&#35805;&#39064;&#26159;&#65306;&#8220;&#23427;&#20570;&#20160;&#20040;&#65311;&#8221;&#35299;&#37322;&#22120;&#30740;
&#31350;&#21521;&#25105;&#20204;&#38416;&#26126;&#36825;&#28857;&#12290;&#35299;&#37322;&#22120;&#33267;&#20851;&#37325;&#35201;&#65292;&#22240;&#20026;&#23427;&#21457;&#38544;&#25225;&#24494;&#65292;&#21448;&#26159;&#26356;&#39640;&#25928;&#32534;&#35793;&#21644;&#20854;&#20182;&#31243;&#24207;&#20998;&#26512;&#30340;
&#19981;&#20108;&#27861;&#38376;&#12290;</p><p>&#26377;&#19968;&#22823;&#31867;&#31995;&#32479;&#65292;&#26681;&#25454;&#35821;&#27861;&#32467;&#26500;&#23558;&#20449;&#24687;&#20174;&#19968;&#31181;&#24418;&#24335;&#36716;&#25442;&#20026;&#21478;&#19968;&#24418;&#24335;&#65292;&#35299;&#37322;&#22120;&#20063;&#26159;&#23427;&#20204;&#30340;&#31034;&#20363;&#12290;
&#20363;&#22914;&#65292;&#32534;&#35793;&#22120;&#23558;&#31243;&#24207;&#36716;&#25442;&#20026;&#36866;&#21512;&#30828;&#20214;&#25110;&#34394;&#25311;&#26426;&#35299;&#37322;&#30340;&#24418;&#24335;&#12290;&#34429;&#28982;&#36890;&#29992;&#30340;&#32534;&#35793;&#25216;&#26415;&#36229;&#20986;&#26412;&#20070;&#33539;
&#22260;&#65292;&#20294;&#25105;&#20204;&#30830;&#23454;&#24320;&#21457;&#20986;&#20102;&#20960;&#20010;&#22522;&#26412;&#30340;&#31243;&#24207;&#32763;&#35793;&#31995;&#32479;&#12290;&#23427;&#20204;&#21453;&#26144;&#20102;&#32534;&#35793;&#20013;&#20856;&#22411;&#30340;&#31243;&#24207;&#20998;&#26512;&#65292;&#27604;
&#22914;&#25511;&#21046;&#36716;&#25442;&#65292;&#21464;&#37327;&#32465;&#23450;&#35299;&#26512;&#65292;&#20197;&#21450;&#31867;&#22411;&#26816;&#26597;&#12290;
<a name="(idx._(gentag._7))"></a></p><p>&#20197;&#19979;&#26159;&#25105;&#20204;&#26041;&#27861;&#30340;&#19968;&#20123;&#29420;&#29305;&#31574;&#30053;&#65306;</p><ol><li><p>&#27599;&#19968;&#26032;&#27010;&#24565;&#37117;&#29992;&#19968;&#31181;&#23567;&#22411;&#35821;&#35328;&#35299;&#37322;&#12290;&#36825;&#20123;&#35821;&#35328;&#36890;&#24120;&#26159;&#28176;&#36827;&#24335;&#30340;&#65306;&#21518;&#38754;&#30340;&#35821;&#35328;&#20381;&#36182;&#21069;
&#38754;&#35821;&#35328;&#30340;&#29305;&#24615;&#12290;</p></li><li><p>&#29992;&#35821;&#35328;&#22788;&#29702;&#22120;&#8212;&#8212;&#22914;&#35299;&#37322;&#22120;&#21644;&#31867;&#22411;&#26816;&#26597;&#22120;&#8212;&#8212;&#35299;&#37322;&#25351;&#23450;&#35821;&#35328;&#25152;&#20889;&#31243;&#24207;&#30340;&#34892;&#20026;&#12290;&#23427;&#20204;&#20197;&#24418;
&#24335;&#21270;&#65288;&#26080;&#27495;&#20041;&#24182;&#19988;&#23436;&#22791;&#65289;&#21644;&#21487;&#25191;&#34892;&#30340;&#26041;&#24335;&#34920;&#29616;&#35821;&#35328;&#35774;&#35745;&#20013;&#30340;&#20915;&#23450;&#12290;</p></li><li><p>&#36866;&#24403;&#30340;&#26102;&#20505;&#65292;&#25105;&#20204;&#29992;&#25509;&#21475;&#21644;&#35268;&#33539;&#24314;&#31435;&#25968;&#25454;&#25277;&#35937;&#12290;&#22914;&#27492;&#65292;&#25105;&#20204;&#21487;&#20197;&#25913;&#21464;&#25968;&#25454;&#30340;&#34920;&#31034;&#32780;
&#19981;&#24517;&#26356;&#25913;&#31243;&#24207;&#12290;&#25105;&#20204;&#20197;&#27492;&#26469;&#30740;&#31350;&#19981;&#21516;&#30340;&#23454;&#29616;&#31574;&#30053;&#12290;</p></li><li><p>&#25105;&#20204;&#30340;&#35821;&#35328;&#22788;&#29702;&#22120;&#22312;&#36739;&#39640;&#23618;&#27425;&#20889;&#23601;&#65292;&#29992;&#20197;&#31616;&#25324;&#22320;&#34920;&#31034;&#35821;&#20041;&#65307;&#21516;&#26102;&#20063;&#22312;&#26497;&#20302;&#23618;&#27425;&#20889;&#23601;&#65292;
&#29992;&#20197;&#29702;&#35299;&#23454;&#29616;&#31574;&#30053;&#12290;</p></li><li><p>&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#29992;&#31616;&#21333;&#30340;&#20195;&#25968;&#25805;&#20316;&#39044;&#27979;&#31243;&#24207;&#34892;&#20026;&#65292;&#25512;&#23548;&#23427;&#20204;&#30340;&#24615;&#36136;&#12290;&#20294;&#25105;&#20204;&#36890;&#24120;&#24456;
&#23569;&#37319;&#29992;&#25968;&#23398;&#31526;&#21495;&#65292;&#32780;&#26159;&#20559;&#29233;&#30740;&#31350;&#31243;&#24207;&#30340;&#34892;&#20026;&#65292;&#23427;&#20204;&#26159;&#25105;&#20204;&#35821;&#35328;&#23454;&#29616;&#30340;&#32452;&#25104;&#37096;&#20998;&#12290;</p></li><li><p>&#27491;&#25991;&#35299;&#37322;&#20851;&#38190;&#27010;&#24565;&#65292;&#20064;&#39064;&#25506;&#35752;&#22791;&#36873;&#35774;&#35745;&#21644;&#20854;&#23427;&#38382;&#39064;&#12290;&#20363;&#22914;&#65292;&#27491;&#25991;&#38416;&#36848;&#38745;&#24577;&#32465;&#23450;&#65292;&#20064;
&#39064;&#35752;&#35770;&#21160;&#24577;&#32465;&#23450;&#12290;&#19968;&#31995;&#21015;&#20064;&#39064;&#23558;&#35789;&#27861;&#23547;&#22336;&#30340;&#27010;&#24565;&#29992;&#20110;&#26412;&#20070;&#35774;&#35745;&#30340;&#21508;&#31181;&#35821;&#35328;&#12290;</p></li></ol><p>&#36890;&#36807;&#23618;&#27425;&#20016;&#23500;&#30340;&#25277;&#35937;&#65292;&#25105;&#20204;&#33021;&#20174;&#22810;&#20010;&#35282;&#24230;&#30475;&#24453;&#32534;&#31243;&#35821;&#35328;&#12290;&#25105;&#20204;&#30340;&#35299;&#37322;&#22120;&#24120;&#24120;&#25552;&#20379;&#39640;&#23618;&#27425;&#35266;&#28857;&#65292;
&#29992;&#21313;&#20998;&#31616;&#27905;&#30340;&#26041;&#24335;&#34920;&#29616;&#35821;&#35328;&#30340;&#35821;&#20041;&#65292;&#36825;&#19982;&#24418;&#24335;&#25968;&#23398;&#35821;&#20041;&#30456;&#21435;&#19981;&#36828;&#12290;&#21478;&#19968;&#20010;&#26497;&#31471;&#26159;&#65292;&#25105;&#20204;&#23637;&#31034;
&#20102;&#31243;&#24207;&#22914;&#20309;&#36716;&#25442;&#20026;&#27719;&#32534;&#35821;&#35328;&#29305;&#26377;&#30340;&#26497;&#20302;&#23618;&#27425;&#24418;&#24335;&#12290;&#36890;&#36807;&#19968;&#20123;&#23567;&#30340;&#27493;&#39588;&#23436;&#25104;&#36825;&#19968;&#36716;&#25442;&#65292;&#25105;&#20204;&#32500;
&#25345;&#20102;&#39640;&#20302;&#23618;&#27425;&#35266;&#28857;&#20043;&#38388;&#30340;&#28165;&#26224;&#32852;&#31995;&#12290;</p><p>&#25105;&#20204;&#23545;&#26412;&#29256;&#20570;&#20102;&#19968;&#20123;&#37325;&#22823;&#25913;&#21160;&#12290;&#23545;&#25152;&#26377;&#37325;&#35201;&#23450;&#20041;&#65292;&#25105;&#20204;&#37117;&#24341;&#20837;&#20102;&#38750;&#27491;&#24335;&#21512;&#32422;&#12290;&#36825;&#26377;&#21161;&#20110;&#38416;&#26126;
&#25152;&#20570;&#30340;&#25277;&#35937;&#12290;&#27492;&#22806;&#65292;&#26032;&#22686;&#20851;&#20110;&#27169;&#22359;&#30340;&#31456;&#33410;&#12290;&#20026;&#20102;&#20351;&#23454;&#29616;&#26356;&#23481;&#26131;&#65292;&#31532; 3&#12289;4&#12289;5&#12289;7 &#21644;&#31532; 8 &#31456;
&#30340;&#28304;&#35821;&#35328;&#20551;&#23450;&#21482;&#33021;&#32473;&#20989;&#25968;&#20256;&#36882;&#19968;&#20010;&#21442;&#25968;&#65307;&#25105;&#20204;&#22686;&#21152;&#20102;&#25903;&#25345;&#22810;&#21442;&#25968;&#36807;&#31243;&#30340;&#20064;&#39064;&#12290;
<a href="cps.html" data-pltdoc="x">&#32493;&#25991;&#20256;&#36882;&#39118;&#26684;</a>&#26159;&#26032;&#22686;&#30340;&#65292;&#22240;&#20026;&#25105;&#20204;&#36873;&#25321;&#20102;&#19968;&#38454;&#32452;&#21512;&#24335;&#32493;&#25991;&#20256;&#36882;&#39118;&#26684;&#21464;&#25442;&#65292;&#32780;&#38750;&#20851;&#31995;&#24335;&#30340;&#12290;&#21516;
&#26102;&#65292;&#30001;&#20110;<span class="emph">&#23614;&#24335;</span> (<span class="emph">tail-form expression</span>)&#30340;&#24615;&#36136;&#65292;&#25105;&#20204;&#22312;&#36825;&#19968;&#31456;&#20351;&#29992;&#22810;&#21442;&#25968;&#36807;&#31243;&#12290;
&#22312;&#23545;&#35937;&#21644;&#31867;&#19968;&#31456;&#21516;&#26679;&#22914;&#27492;&#65292;&#20294;&#36825;&#24182;&#38750;&#24517;&#28982;&#12290;&#27599;&#31456;&#37117;&#32463;&#36807;&#20462;&#35746;&#65292;&#26032;&#22686;&#20102;&#24456;&#22810;&#20064;&#39064;&#12290;</p><h4><a name="(part._pf-org)"></a>&#32452;&#32455;</h4><p>&#21069;&#20004;&#31456;&#20026;&#28145;&#20837;&#23398;&#20064;&#32534;&#31243;&#35821;&#35328;&#22880;&#23450;&#20102;&#22522;&#30784;&#12290;<a href="isd.html" data-pltdoc="x">&#24402;&#32435;&#24335;&#25968;&#25454;&#38598;</a>&#24378;&#35843;&#25968;&#25454;&#30340;&#24402;&#32435;&#24335;&#23450;&#20041;&#27861;&#21644;&#36882;&#24402;&#32534;&#31243;
&#20043;&#38388;&#30340;&#32852;&#31995;&#65292;&#20171;&#32461;&#20102;&#20960;&#20010;&#19982;&#21464;&#37327;&#20316;&#29992;&#22495;&#30456;&#20851;&#30340;&#27010;&#24565;&#12290;<a href="da.html" data-pltdoc="x">&#25968;&#25454;&#25277;&#35937;</a>&#20171;&#32461;&#20102;&#25968;&#25454;&#31867;&#22411;&#24037;&#20855;&#65292;&#30001;
&#27492;&#24341;&#20986;&#20851;&#20110;&#25968;&#25454;&#25277;&#35937;&#30340;&#35752;&#35770;&#21644;&#34920;&#31034;&#26041;&#24335;&#36716;&#25442;&#30340;&#20363;&#23376;&#65292;&#36825;&#31181;&#36716;&#25442;&#23558;&#22312;&#21518;&#38754;&#30340;&#31456;&#33410;&#20013;&#20351;&#29992;&#12290;</p><p><a href="expr.html" data-pltdoc="x">&#34920;&#36798;&#24335;</a>&#20351;&#29992;&#36825;&#20123;&#22522;&#30784;&#25551;&#36848;&#32534;&#31243;&#35821;&#35328;&#30340;&#34892;&#20026;&#12290;&#26412;&#31456;&#20171;&#32461;&#35299;&#37322;&#22120;&#65292;&#20316;&#20026;&#35299;&#37322;&#35821;&#35328;&#36816;&#34892;&#26102;
&#34892;&#20026;&#30340;&#26426;&#21046;&#65292;&#24182;&#20026;&#19968;&#38376;&#31616;&#21333;&#30340;&#35789;&#27861;&#20316;&#29992;&#22495;&#35821;&#35328;&#35774;&#35745;&#20102;&#35299;&#37322;&#22120;&#65292;&#35813;&#35821;&#35328;&#25903;&#25345;&#19968;&#31561;&#36807;&#31243;&#21644;&#36882;&#24402;&#12290;
&#36825;&#20010;&#35299;&#37322;&#22120;&#26159;&#26412;&#20070;&#21518;&#32493;&#37096;&#20998;&#35768;&#22810;&#26448;&#26009;&#30340;&#22522;&#30784;&#12290;&#26412;&#31456;&#32467;&#23614;&#35814;&#32454;&#35752;&#35770;&#20102;&#19968;&#31181;&#29992;&#32034;&#24341;&#20195;&#26367;&#21464;&#37327;&#30340;&#35821;
&#35328;&#65292;&#32467;&#26524;&#20415;&#26159;&#65292;&#21464;&#37327;&#26597;&#35810;&#21487;&#30001;&#21015;&#34920;&#24341;&#29992;&#23436;&#25104;&#12290;</p><p><a href="state.html" data-pltdoc="x">&#29366;&#24577;</a>&#20171;&#32461;&#30340;&#26032;&#32452;&#20214;&#8212;&#8212;&#29366;&#24577;&#8212;&#8212;&#23558;&#20301;&#32622;&#19982;&#20540;&#23545;&#24212;&#12290;&#21152;&#20837;&#20102;&#23427;&#65292;&#25105;&#20204;&#23601;&#33021;&#30740;&#31350;&#20851;&#20110;&#34920;&#31034;
&#26041;&#24335;&#30340;&#21508;&#31181;&#38382;&#39064;&#12290;&#27492;&#22806;&#65292;&#23427;&#36824;&#20351;&#25105;&#20204;&#33021;&#22815;&#25506;&#32034;&#25353;&#25351;&#35843;&#29992;&#12289;&#25353;&#21517;&#35843;&#29992;&#21644;&#25353;&#38656;&#35843;&#29992;&#30340;&#21442;&#25968;&#20256;&#36882;&#26426;
&#21046;&#12290;</p><p><a href="cpi.html" data-pltdoc="x">&#20256;&#36882;&#32493;&#25991;&#30340;&#35299;&#37322;&#22120;</a>&#29992;&#32493;&#25991;&#20256;&#36882;&#39118;&#26684;&#37325;&#20889;&#25105;&#20204;&#30340;&#22522;&#30784;&#35299;&#37322;&#22120;&#12290;&#36816;&#34892;&#35299;&#37322;&#22120;&#25152;&#38656;&#30340;&#25511;&#21046;&#32467;&#26500;&#38543;&#20043;&#20174;&#36882;
&#24402;&#36716;&#21464;&#20026;&#36845;&#20195;&#12290;&#36825;&#25581;&#31034;&#20102;&#35299;&#37322;&#24615;&#35821;&#35328;&#30340;&#25511;&#21046;&#26426;&#21046;&#65292;&#24378;&#21270;&#20102;&#23545;&#25511;&#21046;&#38382;&#39064;&#30340;&#25972;&#20307;&#30452;&#35273;&#12290;&#23427;&#20063;&#20351;&#25105;
&#20204;&#33021;&#22815;&#29992;&#36454;&#24202;&#12289;&#24322;&#24120;&#22788;&#29702;&#21644;&#22810;&#32447;&#31243;&#26426;&#21046;&#25193;&#23637;&#35821;&#35328;&#12290;</p><p><a href="cps.html" data-pltdoc="x">&#32493;&#25991;&#20256;&#36882;&#39118;&#26684;</a>&#26159;&#19978;&#19968;&#31456;&#30340;&#32493;&#31687;&#12290;&#19978;&#19968;&#31456;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#25226;&#25105;&#20204;&#29087;&#24713;&#30340;&#35299;&#37322;&#22120;&#36716;&#25442;&#20026;&#32493;&#25991;&#20256;&#36882;
&#39118;&#26684;&#65292;&#26412;&#31456;&#25105;&#20204;&#23637;&#31034;&#20102;&#22914;&#20309;&#20026;&#26356;&#22823;&#30340;&#19968;&#31867;&#31243;&#24207;&#23436;&#25104;&#36716;&#25442;&#12290;&#32493;&#25991;&#20256;&#36882;&#39118;&#26684;&#26159;&#19968;&#31181;&#24378;&#22823;&#30340;&#32534;&#31243;&#24037;
&#20855;&#65292;&#22240;&#20026;&#23427;&#20351;&#20960;&#20046;&#25152;&#26377;&#35821;&#35328;&#37117;&#33021;&#23454;&#29616;&#20219;&#24847;&#30340;&#39034;&#24207;&#25511;&#21046;&#26426;&#21046;&#12290;&#36825;&#19968;&#31639;&#27861;&#20063;&#26159;&#25277;&#35937;&#25551;&#36848;&#28304;&#21040;&#28304;&#31243;
&#24207;&#36716;&#25442;&#30340;&#20363;&#23376;&#12290;</p><p><a href="types.html" data-pltdoc="x">&#31867;&#22411;</a>&#23558;<a href="expr.html" data-pltdoc="x">&#34920;&#36798;&#24335;</a>&#30340;&#35821;&#35328;&#36716;&#25442;&#20026;&#26377;&#31867;&#22411;&#30340;&#35821;&#35328;&#12290;&#39318;&#20808;&#25105;&#20204;&#23454;&#29616;&#19968;&#20010;&#31867;&#22411;&#26816;&#26597;
&#22120;&#12290;&#28982;&#21518;&#25105;&#20204;&#23637;&#31034;&#22914;&#20309;&#29992;&#22522;&#20110;&#21512;&#19968;&#30340;&#31867;&#22411;&#25512;&#23548;&#31639;&#27861;&#25512;&#26029;&#31243;&#24207;&#20013;&#30340;&#31867;&#22411;&#12290;</p><p><a href="modules.html" data-pltdoc="x">&#27169;&#22359;</a>&#24314;&#31435;&#31867;&#22411;&#27169;&#22359;&#65292;&#36825;&#26497;&#24230;&#20381;&#36182;&#23545;&#21069;&#19968;&#31456;&#30340;&#29702;&#35299;&#12290;&#27169;&#22359;&#26082;&#20351;&#25105;&#20204;&#33021;&#22815;&#24314;&#31435;&#21644;&#24378;
&#21270;&#25277;&#35937;&#36793;&#30028;&#65292;&#21448;&#25552;&#20379;&#20102;&#26032;&#30340;&#23450;&#30028;&#26041;&#24335;&#12290;</p><p><a href="oac.html" data-pltdoc="x">&#23545;&#35937;&#21644;&#31867;</a>&#20197;&#31867;&#20026;&#20013;&#24515;&#65292;&#23637;&#31034;&#20102;&#38754;&#21521;&#23545;&#35937;&#32534;&#31243;&#35821;&#35328;&#30340;&#22522;&#26412;&#27010;&#24565;&#12290;&#25105;&#20204;&#39318;&#20808;&#35774;&#35745;&#20102;&#39640;&#25928;&#30340;&#36816;
&#34892;&#26102;&#32467;&#26500;&#65292;&#20316;&#20026;&#26412;&#31456;&#31532;&#20108;&#37096;&#20998;&#20869;&#23481;&#30340;&#22522;&#30784;&#12290;&#31532;&#20108;&#37096;&#20998;&#23558;<a href="types.html" data-pltdoc="x">&#31867;&#22411;</a>&#30340;&#31867;&#22411;&#26816;&#26597;&#22120;&#24605;&#24819;&#21644;
&#31532;&#19968;&#37096;&#20998;&#30340;&#38754;&#21521;&#23545;&#35937;&#32534;&#31243;&#35821;&#35328;&#32467;&#21512;&#36215;&#26469;&#65292;&#32467;&#26524;&#20415;&#26159;&#20256;&#32479;&#30340;&#26377;&#31867;&#22411;&#38754;&#21521;&#23545;&#35937;&#35821;&#35328;&#12290;&#36825;&#35201;&#27714;&#24341;&#20837;
&#26032;&#30340;&#27010;&#24565;&#65292;&#21253;&#25324;&#25509;&#21475;&#12289;&#25277;&#35937;&#26041;&#27861;&#21644;&#24378;&#21046;&#36716;&#25442;&#12290;</p><p>&#8220;<a href="further-reading.html#%28elem._readings%29" data-pltdoc="x"><span class="emph">&#25193;&#23637;&#38405;&#35835;</span></a>&#8221;&#35299;&#37322;&#20102;&#26412;&#20070;&#30340;
&#27599;&#19968;&#24605;&#24819;&#28304;&#20110;&#20309;&#22788;&#12290;&#34429;&#28982;&#26377;&#26102;&#25105;&#20204;&#21482;&#21015;&#20986;&#20102;&#33021;&#25509;&#35302;&#21040;&#30340;&#26469;&#28304;&#65292;&#35835;&#32773;&#27867;&#35272;&#26412;&#31456;&#65292;&#20173;&#33021;&#31397;&#28304;&#35775;&#26412;&#12290;</p><p>&#26368;&#21518;&#65292;<a href="sllgen-parsing-system.html#%28elem._sllgen%29" data-pltdoc="x">&#38468;&#24405; B</a> &#20171;&#32461;&#20102;&#25105;&#20204;&#30340; SLLGEN &#35299;&#26512;&#31995;&#32479;&#12290;</p><p>&#21508;&#31456;&#30340;&#20381;&#36182;&#20851;&#31995;&#22914;&#19979;&#22270;&#25152;&#31034;&#12290;</p><blockquote class="SCentered"><p><img src="structure.svg" alt="章节依赖关系" width="504.0pt" height="196.5pt"/></p></blockquote><h4><a name="(part._pf-use)"></a>&#29992;&#27861;</h4><p>&#26412;&#20070;&#22312;&#26412;&#31185;&#29983;&#21644;&#30740;&#31350;&#29983;&#35838;&#31243;&#20013;&#22343;&#24050;&#20351;&#29992;&#65292;&#20063;&#24050;&#22312;&#32844;&#19994;&#31243;&#24207;&#21592;&#30340;&#25345;&#32493;&#25945;&#32946;&#35838;&#31243;&#20013;&#20351;&#29992;&#12290;&#25105;&#20204;&#20551;
&#23450;&#30340;&#32972;&#26223;&#30693;&#35782;&#26377;&#25968;&#25454;&#32467;&#26500;&#65292;&#36807;&#31243;&#24335;&#35821;&#35328;&#65288;&#22914;C&#12289;C++&#12289;Java&#65289;&#21644; Scheme&#12289;ML&#12289;Python &#25110;
Haskell &#30340;&#32534;&#31243;&#32463;&#39564;&#12290;</p><p>&#20064;&#39064;&#26159;&#25991;&#26412;&#30340;&#37325;&#35201;&#37096;&#20998;&#65292;&#25955;&#35265;&#20110;&#21508;&#22788;&#12290;&#23427;&#20204;&#38590;&#26131;&#26377;&#21035;&#65292;&#31616;&#21333;&#32773;&#65292;&#29702;&#35299;&#30456;&#20851;&#26448;&#26009;&#20415;&#36731;&#32780;&#26131;&#20030;
&#65288;&#26631;&#20026; <span class="texMathInline">\textnormal{[}{\star}\textnormal{]}</span>&#65289;&#65307;&#22256;&#38590;&#32773;&#65292;&#38656;&#35201;&#33457;&#36153;&#22823;&#37327;&#24605;&#32771;&#21644;&#32534;&#31243;&#24037;&#20316;&#65288;&#26631;&#20026;
<span class="texMathInline">\textnormal{[}{\star}{\star}{\star}\textnormal{]}</span>&#65289;&#12290;&#22823;&#37327;&#20851;&#20110;&#24212;&#29992;&#65292;&#21382;&#21490;&#20197;&#21450;&#29702;&#35770;&#30340;&#26448;&#26009;&#28508;&#34255;&#20854;&#38388;&#12290;&#25105;&#20204;&#24314;&#35758;&#35835;&#19968;&#35835;
&#27599;&#36947;&#20064;&#39064;&#65292;&#24819;&#19968;&#24819;&#22914;&#20309;&#35299;&#20915;&#23427;&#20204;&#12290;&#34429;&#28982;&#25105;&#20204;&#29992; Scheme &#32534;&#20889;&#35299;&#37322;&#31243;&#24207;&#21644;&#36716;&#25442;&#31995;&#32479;&#65292;&#20219;&#20309;&#25903;&#25345;
&#19968;&#31561;&#36807;&#31243;&#21644;&#36171;&#20540;&#30340;&#35821;&#35328;&#65288;ML&#12289;Common Lisp&#12289;Python&#12289;Ruby&#31561;&#31561;&#65289;&#37117;&#36275;&#20197;&#23436;&#25104;&#26412;&#20070;&#32451;&#20064;&#12290;</p><blockquote class="EoplExercise"><p><a name="(elem._ex0..1)"></a><span class="texMathInline">\textnormal{[}{\star}\textnormal{]}</span><span class="hspace">&nbsp;</span>&#25105;&#20204;&#24120;&#35828;&#8220;&#26576;&#35821;&#35328;&#20855;&#26377;&#26576;&#24615;&#36136;&#8221;&#12290;&#20026;&#27599;&#31181;&#35828;&#27861;&#25214;&#20986;&#19968;&#31181;&#25110;&#22810;
&#31181;&#20855;&#26377;&#35813;&#24615;&#36136;&#30340;&#35821;&#35328;&#65292;&#20197;&#21450;&#19968;&#31181;&#25110;&#22810;&#31181;&#19981;&#20855;&#26377;&#35813;&#24615;&#36136;&#30340;&#35821;&#35328;&#12290;&#35831;&#38543;&#24847;&#25628;&#32034;&#36825;&#20123;&#20449;&#24687;&#65292;&#19981;&#25304;
&#20219;&#20309;&#32534;&#31243;&#35821;&#35328;&#30340;&#20171;&#32461;&#24615;&#20070;&#31821;&#65288;&#27604;&#22914; Scott(2005)&#65292;Sebesta (2007)&#65292;&#25110;&#32773; Pratt &amp;
Zelkowitz(2001)&#65289;&#12290;<br/></p></blockquote><p>&#36825;&#26159;&#26412;&#23454;&#36341;&#24615;&#30340;&#20070;&#65306;&#26412;&#20070;&#35752;&#35770;&#30340;&#19968;&#20999;&#37117;&#21487;&#22312;&#36890;&#24120;&#30340;&#22823;&#23398;&#35838;&#31243;&#38480;&#24230;&#20869;&#23436;&#25104;&#12290;&#22240;&#20026;&#20989;&#25968;&#24335;&#35821;&#35328;&#30340;
&#25277;&#35937;&#29305;&#24615;&#23588;&#20854;&#36866;&#21512;&#36825;&#31867;&#32534;&#31243;&#65292;&#25105;&#20204;&#21487;&#20197;&#20889;&#20986;&#24378;&#22823;&#30340;&#35821;&#35328;&#22788;&#29702;&#31995;&#32479;&#65292;&#26082;&#31616;&#27905;&#65292;&#21448;&#33021;&#20197;&#36866;&#24403;&#30340;&#21162;
&#21147;&#25484;&#25569;&#12290;</p><p>&#32593;&#31449;&#30001;&#20986;&#29256;&#31038;&#25552;&#20379;&#65292;&#21253;&#21547;&#26412;&#20070;&#25152;&#26377;&#35299;&#37322;&#22120;&#21644;&#20998;&#26512;&#22120;&#30340;&#23436;&#25972; Scheme &#20195;&#30721;&#12290;&#20195;&#30721;&#29992; PLT
Scheme &#20889;&#25104;&#12290;<span class="NoteBox"><span class="NoteContent">&#26412;&#20070;&#32593;&#31449;&#24050;&#36801;&#31227;&#33267; <a href="http://www.eopl3.com"><span class="url">http://www.eopl3.com</span></a>&#65292;&#20195;&#30721;&#25913;&#29992; Racket
&#23454;&#29616;&#65292;&#32593;&#22336;&#20026; <a href="https://github.com/mwand/eopl3"><span class="url">https://github.com/mwand/eopl3</span></a>&#12290;&#8212;&#8212;<span class="emph">&#35793;&#27880;</span></span></span>&#25105;&#20204;&#36873;&#25321;&#36825;&#31181;
Scheme &#23454;&#29616;&#65292;&#26159;&#22240;&#20026;&#23427;&#30340;&#27169;&#22359;&#31995;&#32479;&#21644;&#32534;&#31243;&#29615;&#22659;&#23545;&#23398;&#29983;&#21161;&#30410;&#33391;&#22810;&#12290;&#20195;&#30721;&#22810;&#21322;&#20860;&#23481;&#20110;
R<span style="vertical-align: super; font-size: 80%">5</span>RS&#65292;&#24403;&#33021;&#36731;&#26131;&#31227;&#26893;&#21040;&#20219;&#20309;&#21151;&#33021;&#23436;&#25972;&#30340; Scheme &#23454;&#29616;&#12290;</p><div class="navsetbottom"><span class="navleft"><div class="nosearchform"></div>&nbsp;&nbsp;<span class="tocsettoggle">&nbsp;&nbsp;<a href="javascript:void(0);" title="show/hide table of contents" onclick="TocsetToggle();">contents</a></span></span><span class="navright">&nbsp;&nbsp;<a href="fw.html" title="backward to &quot;序&quot;" data-pltdoc="x">&larr; prev</a>&nbsp;&nbsp;<a href="index.html" title="up to &quot;编程语言要素&quot;" data-pltdoc="x">up</a>&nbsp;&nbsp;<a href="awk.html" title="forward to &quot;致谢&quot;" data-pltdoc="x">next &rarr;</a></span>&nbsp;</div></div></div><div id="contextindicator">&nbsp;</div></body></html>